Revit 2027 API
ExternalGeometryId Constructor
 Constructs an ExternalGeometryId object holding the given external geometry identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalGeometryId(
	string externalGeometryId
)
Public Sub New (
	externalGeometryId As String
)
public:
ExternalGeometryId(
	String^ externalGeometryId
)
new :
        externalGeometryId : string -> ExternalGeometryId
Parameters
externalGeometryId String
 A string that represents an identifier for an external geometry.
Exceptions
Exception | Condition
ArgumentException |  externalGeometryId is not a valid ExternalGeometryId.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExternalGeometryId Class
Autodesk.Revit.DB Namespace